package manager;
/*
* Сделал все пункты тз, необходимые тесты, но не смог понять зачем мне делать данный абстрактный класс. У меня
* FileBackedTaskManager расширяет возможности InMemoryTaskManager, получается он у меня отвечает как за хранение задач
* в памяти, так и за запись их в файл. Но тесты у меня в двух разных классах, отвечающих за хранение в памяти и
* работу с файлами соответственно. Не могу понять как мне использовать абстрактный файл для того чтобы не дублировать
* код, ведь FileBackedTaskManager у меня и так завязан на коде из InMemoryTaskManager.
*
* Понимаю что ревью я так не пройду, но поскольку решения я так и не нашел, за долгое время, решил пока сдать работу
* как есть, с нереализованным данным классом, чтобы не стоять просто так в ступоре..
* */
abstract class TZ8TaskManagerTest<T extends TaskManager> {

}
